FKDD_COPY_DIFF_3_2026-02-14/Catalogs/Карточки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Карточки</Name>
			<Comment>Дисконтные, пользовательские, командные карты</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКарточки</Name>
					<Comment>Вид карточки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКарточек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект, идентифицируемый карточкой в зависимости от вида</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Comment>Печатное наименование карточки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий по карточке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПовторно</Name>
					<Comment>Признак повторного использования дисконтной карты</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата создания карточки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Момент изменения карточки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номинал</Name>
					<Comment>Номинал талона</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БонуснаяПрограмма</Name>
					<Comment>Бонусная программа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеПрограммы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/ВидыКарточек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыКарточек</Name>
			<Comment>Виды карточек</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Comment>Дисконтная карта</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КарточкаПользователя</Name>
					<Comment>Карточка пользователя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СлужебнаяОперация</Name>
					<Comment>Служебная операция</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Чистая</Name>
					<Comment>Чистая карточка</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Талон</Name>
					<Comment>Талон / купон</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлубнаяКарта</Name>
					<Comment>Клубная карта</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Catalogs/Карточки/Ext/ManagerModule.bsl
// Процедура заполнения предопределенных элементов справочника
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	КарточкиДисконтнаяКарта = Справочники.Карточки.ДисконтнаяКарта.ПолучитьОбъект();
	Если ЗаполнятьВсе Тогда
		КарточкиДисконтнаяКарта.ВидКарточки = Перечисления.ВидыКарточек.ДисконтнаяКарта;
	ИначеЕсли обЗначениеНеЗаполнено(КарточкиДисконтнаяКарта.ВидКарточки) Тогда
		КарточкиДисконтнаяКарта.ВидКарточки = Перечисления.ВидыКарточек.ДисконтнаяКарта;
	КонецЕсли;
	//Сохранение справочника
	НовыйЭлемент = КарточкиДисконтнаяКарта.ЭтоНовый();
	Если КарточкиДисконтнаяКарта.Модифицированность() Тогда
		Попытка
			КарточкиДисконтнаяКарта.Записать();
			Сообщить("Справочник ""Карточки"". "+?(НовыйЭлемент,"Добавлен","Обновлен")+" элемент """+СокрЛП(КарточкиДисконтнаяКарта.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	КарточкиНеНайденнаяКарта = Справочники.Карточки.НеНайденнаяКарта.ПолучитьОбъект();
	Если ЗаполнятьВсе Тогда
		КарточкиНеНайденнаяКарта.ВидКарточки = Перечисления.ВидыКарточек.ДисконтнаяКарта;
	ИначеЕсли обЗначениеНеЗаполнено(КарточкиНеНайденнаяКарта.ВидКарточки) Тогда
		КарточкиНеНайденнаяКарта.ВидКарточки = Перечисления.ВидыКарточек.ДисконтнаяКарта;
	КонецЕсли;
	//Сохранение справочника
	НовыйЭлемент = КарточкиНеНайденнаяКарта.ЭтоНовый();
	Если КарточкиНеНайденнаяКарта.Модифицированность() Тогда
		Попытка
			КарточкиНеНайденнаяКарта.Записать();
			Сообщить("Справочник ""Карточки"". "+?(НовыйЭлемент,"Добавлен","Обновлен")+" элемент """+СокрЛП(КарточкиНеНайденнаяКарта.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	КарточкиКарточкаПользователя = Справочники.Карточки.КарточкаПользователя.ПолучитьОбъект();
	Если ЗаполнятьВсе Тогда
		КарточкиКарточкаПользователя.ВидКарточки = Перечисления.ВидыКарточек.КарточкаПользователя;
	ИначеЕсли обЗначениеНеЗаполнено(КарточкиКарточкаПользователя.ВидКарточки) Тогда
		КарточкиКарточкаПользователя.ВидКарточки = Перечисления.ВидыКарточек.КарточкаПользователя;
	КонецЕсли;
	//Сохранение справочника
	НовыйЭлемент = КарточкиКарточкаПользователя.ЭтоНовый();
	Если КарточкиКарточкаПользователя.Модифицированность() Тогда
		Попытка
			КарточкиКарточкаПользователя.Записать();
			Сообщить("Справочник ""Карточки"". "+?(НовыйЭлемент,"Добавлен","Обновлен")+" элемент """+СокрЛП(КарточкиКарточкаПользователя.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	КарточкиСлужебнаяОперация = Справочники.Карточки.СлужебнаяОперация.ПолучитьОбъект();
	Если ЗаполнятьВсе Тогда
		КарточкиСлужебнаяОперация.ВидКарточки = Перечисления.ВидыКарточек.СлужебнаяОперация;
	ИначеЕсли обЗначениеНеЗаполнено(КарточкиСлужебнаяОперация.ВидКарточки) Тогда
		КарточкиСлужебнаяОперация.ВидКарточки = Перечисления.ВидыКарточек.СлужебнаяОперация;
	КонецЕсли;
	//Сохранение справочника
	НовыйЭлемент = КарточкиСлужебнаяОперация.ЭтоНовый();
	Если КарточкиСлужебнаяОперация.Модифицированность() Тогда
		Попытка
			КарточкиСлужебнаяОперация.Записать();
			Сообщить("Справочник ""Карточки"". "+?(НовыйЭлемент,"Добавлен","Обновлен")+" элемент """+СокрЛП(КарточкиСлужебнаяОперация.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	КарточкиЧистая = Справочники.Карточки.Чистая.ПолучитьОбъект();
	Если ЗаполнятьВсе Тогда
		КарточкиЧистая.ВидКарточки = Перечисления.ВидыКарточек.Чистая;
	ИначеЕсли обЗначениеНеЗаполнено(КарточкиЧистая.ВидКарточки) Тогда
		КарточкиЧистая.ВидКарточки = Перечисления.ВидыКарточек.Чистая;
	КонецЕсли;
	//Сохранение справочника
	НовыйЭлемент = КарточкиЧистая.ЭтоНовый();
	Если КарточкиЧистая.Модифицированность() Тогда
		Попытка
			КарточкиЧистая.Записать();
			Сообщить("Справочник ""Карточки"". "+?(НовыйЭлемент,"Добавлен","Обновлен")+" элемент """+СокрЛП(КарточкиЧистая.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	КарточкиКлубнаяКарта = Справочники.Карточки.КлубнаяКарта.ПолучитьОбъект();
	Если ЗаполнятьВсе Тогда
		КарточкиКлубнаяКарта.ВидКарточки = Перечисления.ВидыКарточек.КлубнаяКарта;
	ИначеЕсли обЗначениеНеЗаполнено(КарточкиКлубнаяКарта.ВидКарточки) Тогда
		КарточкиКлубнаяКарта.ВидКарточки = Перечисления.ВидыКарточек.КлубнаяКарта;
	КонецЕсли;
	//Сохранение справочника
	НовыйЭлемент = КарточкиКлубнаяКарта.ЭтоНовый();
	Если КарточкиКлубнаяКарта.Модифицированность() Тогда
		Попытка
			КарточкиКлубнаяКарта.Записать();
			Сообщить("Справочник ""Карточки"". "+?(НовыйЭлемент,"Добавлен","Обновлен")+" элемент """+СокрЛП(КарточкиКлубнаяКарта.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	КарточкиТалон = Справочники.Карточки.Талон.ПолучитьОбъект();
	Если ЗаполнятьВсе Тогда
		КарточкиТалон.ВидКарточки = Перечисления.ВидыКарточек.Талон;
	ИначеЕсли обЗначениеНеЗаполнено(КарточкиТалон.ВидКарточки) Тогда
		КарточкиТалон.ВидКарточки = Перечисления.ВидыКарточек.Талон;
	КонецЕсли;
	//Сохранение справочника
	НовыйЭлемент = КарточкиТалон.ЭтоНовый();
	Если КарточкиТалон.Модифицированность() Тогда
		Попытка
			КарточкиТалон.Записать();
			Сообщить("Справочник ""Карточки"". "+?(НовыйЭлемент,"Добавлен","Обновлен")+" элемент """+СокрЛП(КарточкиТалон.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;	
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()
